# Parameter Type Id Mep Horizontail Offset Property

Source: https://www.revitapidocs.com/2026/05bb3eea-93bf-0b70-5dea-d7c8568fb5e2.htm

---

| Parameter Type Id Mep Horizontail Offset Property |
| --- |

"Horizontal Offset"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId MepHorizontailOffset { get; }
```

```
Public Shared ReadOnly Property MepHorizontailOffset As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ MepHorizontailOffset {
	ForgeTypeId^ get ();
}
```

```
static member MepHorizontailOffset : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace